@JPLachance I think your tf settings are messing this up for you. This is what I get:

my main.tf:

```terraform
terraform {
  required_providers {
    okta = {
      source = "okta/okta"
    }
  }
}

resource "okta_group" "example" {
  name        = "Example"
  description = "My Example Group"
}

resource "okta_app_saml" "example" {
  label                    = "example"
  sso_url                  = "https://example.com"
  recipient                = "https://example.com"
  destination              = "https://example.com"
  audience                 = "https://example.com/audience"
  subject_name_id_template = "$${user.userName}"
  subject_name_id_format   = "urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress"
  response_signed          = true
  signature_algorithm      = "RSA_SHA256"
  digest_algorithm         = "SHA256"
  honor_force_authn        = false
  authn_context_class_ref  = "urn:oasis:names:tc:SAML:2.0:ac:classes:PasswordProtectedTransport"

  attribute_statements {
    type         = "GROUP"
    name         = "groups"
    filter_type  = "REGEX"
    filter_value = ".*"
  }
}
```

```shell
export OKTA_API_TOKEN=XXXX
export OKTA_ORG_NAME=myorg
export OKTA_BASE_URL=okta.com

terraform init
terraform apply

# ....
Terraform will perform the following actions:

  # okta_app_saml.example will be created
  + resource "okta_app_saml" "example" {
      + accessibility_self_service = false
      + audience                   = "https://example.com/audience"
      + authn_context_class_ref    = "urn:oasis:names:tc:SAML:2.0:ac:classes:PasswordProtectedTransport"
      + auto_submit_toolbar        = false
      + certificate                = (known after apply)
      + destination                = "https://example.com"
      + digest_algorithm           = "SHA256"
      + entity_key                 = (known after apply)
      + entity_url                 = (known after apply)
      + hide_ios                   = false
      + hide_web                   = false
      + honor_force_authn          = false
      + http_post_binding          = (known after apply)
      + http_redirect_binding      = (known after apply)
      + id                         = (known after apply)
      + key_id                     = (known after apply)
      + label                      = "example"
      + logo_url                   = (known after apply)
      + metadata                   = (known after apply)
      + metadata_url               = (known after apply)
      + name                       = (known after apply)
      + recipient                  = "https://example.com"
      + response_signed            = true
      + saml_version               = "2.0"
      + sign_on_mode               = (known after apply)
      + signature_algorithm        = "RSA_SHA256"
      + skip_groups                = false
      + skip_users                 = false
      + sso_url                    = "https://example.com"
      + status                     = "ACTIVE"
      + subject_name_id_format     = "urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress"
      + subject_name_id_template   = "${user.userName}"
      + user_name_template         = "${source.login}"
      + user_name_template_type    = "BUILT_IN"

      + attribute_statements {
          + filter_type  = "REGEX"
          + filter_value = ".*"
          + name         = "groups"
          + namespace    = "urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"
          + type         = "GROUP"
        }
    }

  # okta_group.example will be created
  + resource "okta_group" "example" {
      + description = "My Example Group"
      + id          = (known after apply)
      + name        = "Example"
      + skip_users  = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

okta_group.example: Creating...
okta_app_saml.example: Creating...
okta_group.example: Creation complete after 0s [id=00g15ptyfqkPEKunI0h8]
okta_app_saml.example: Creation complete after 1s [id=0oa15ptz2j9msjJFW0h8]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```